{
    "DONT-CHANGE-ANYTHING-IN-THIS-FILE": "DONT CHANGE ANYTHING IN THIS FILE UNLESS YOU KNOW WHAT YOU'RE DOING",

    "version": "1.6.0",
    "branch": "dev",

    "versionText": "",
    "todo": {
        "Remove game.dirname": ["done", "Remove the `game.dirname` field. This was added because i once misspelled '__dirname' as '__dirname__' and it didn't work, so i added `game.dirname`."],
        "Add regex toggle to the breaking change script": ["done", "If you don't need/use/understand regex, having regex be enabled is a pain. So add a way to toggle it."],
        "Allow looking up vanilla cards using their dbfId": ["done", "Look up cards using their dbfId instead of their name, since their name is not unique but their dbfId is. For example the dbfId of 'Jade Idol' is 40372"],
        "Remove the warning from the history command": ["done", "When i first added the history command, it was buggy so i added a warning when you used it and forgot to remove it."],
        "Add a description to config todos": ["done", "Add a description to each todo element."],
        "Merge the two log files": ["done", "Merge the normal and the ai log files into one log file. I really didn't need two log files for logging."],
        "Make renathal actually work with the dc": ["done", "Prince Renathal was bugged and so adding it in the deck creator didn't properlly set the max amount of cards to 40."],
        "Seperate the custom card creator into its own file": ["done", "The custom card creator and the card creator library is currently in the same file, so if the vanilla card creator wants to create a card, it needs to call the custom card creator(?) which contains the library. This ment that the custom card creator had a lot of spaghetti code since it had to act like a library sometimes, and act like the custom card creator sometimes."],
        "Discover filter class cards by default": ["done", "Make it so the discover function automatically removes cards from the pool that doesn't match the class of the player. It does this by default if you don't include a custom pool, but most times you do want to include a custom pool and in that case, you have the remove those cards manually. Instead i will make it so it automatically does this, unless you explicitly tell it not to."],
        "Remove outdated event broadcast": ["done", "Remove the outdated event broadcast. Also make it so when minions with reborn dies, they still get moved to the graveyard and grant one corpse."],
        "Fix a clc bug": ["done", "Fix a class creator bug. If you answered any prompt with an answer that starts with 'b', it will exit the program."],
        "Remove update parameters from all functions": ["done", "A lot of player / card functions has an update parameter. Replace it with a more generalized solution."],
        "Add better documentation": ["done", "Add better documentation to the different functions in the program."],
        "Bug fixing / stabilze": ["doing", "Fix bugs and stabilze. Get the version ready for release. Add all unit tests."],
        "Bump version": ["not done", "Update the version. Release the update."]
    },

    "exampleTodo": {
        "one": ["first pass", "Description."],
        "two": ["second pass", "Another description."],
        "three": ["not done", "A third description."],
        "four": ["done", "A fourth description."],
        "five": ["doing", "A fifth description."],
        "this gives us": {
            "one":   "[first pass] one",
            "two":   "[second pass] two",
            "three": "[ ] three",
            "four":  "[x] four",
            "five":  "[o] five"
        }
    },

    "stableIntroText": "This is the main (stable) branch. This branch is older, but is more stable. I recommend you use this branch.",
    "developIntroText": "This is the develop (beta) branch. This has more features, but is less stable. I would advise against using this branch if you can help it. The todo list is not final and can change.",
    "topicIntroText": "This is a topic (feature) branch. This branch exists to add one single feature, can be highly unstable, and will be deleted in the future once the feature is done. I HIGHLY RECOMMEND NOT USING THIS BRANCH FOR ANY REASON."
}