{
    "DONT CHANGE ANYTHING IN THIS FILE": "DONT CHANGE ANYTHING IN THIS FILE UNLESS YOU KNOW WHAT YOU'RE DOING",

    "version": "1.7.0",
    "branch": "dev",

    "versionText": "",
    "todo": {
        "Add a command history": ["done", "Add a command that allows you to see your command / input history. You could then choose a command and, for example, rerun it or maybe reverse it, etc..."],
        "Make Prince Renathal not as hardcoded": ["done", "Prince Renathal right now is pretty hardcoded, so fix that."],
        "Fix dc renathal bug": ["not done", "If you add Prince Renathal to a deck in the deck creator, then remove him, the deck will still require 40 cards. This is only a bug on the deck creator side, and the resulting deck would be pseudo-valid."],
        "Cc multiple keyword methods": ["not done", "Allow the card creator to add multiple keyword methods per card."],
        "Make a replay system": ["not done", "Add a replay system so you can save a game to a file to replay like a video. This would make bugfixing a lot easier."],
        "Add more input options to the ccc": ["not done", "Add more input options to the custom card creator, other than question."],
        "Do more extensive testing": ["not done", "Do more extensive testing. Add more test cases per test, and make sure all function have a test."],
        "Add a guide script": ["not done", "This could guide you through the game, the dc, and the cc (maybe even teach you how to make cards). It would be like a tutorial."]
    },

    "exampleTodo": {
        "one": ["first pass", "Description."],
        "two": ["second pass", "Another description."],
        "three": ["not done", "A third description."],
        "four": ["doing", "A fourth description."],
        "five": ["done", "A fifth description."],
        "this gives us": {
            "one":   "[first pass] one",
            "two":   "[second pass] two",
            "three": "[ ] three",
            "four":  "[o] four",
            "five":  "[x] five"
        }
    },

    "stableIntroText": "This is the main (stable) branch. This branch is older, but is more stable. I recommend you use this branch.",
    "developIntroText": "This is the develop (beta) branch. This has more features, but is less stable. I would advise against using this branch if you can help it. The todo list is not final and can change.",
    "topicIntroText": "This is a topic (feature) branch. This branch exists to add one single feature, can be highly unstable, and will be deleted in the future once the feature is done. I HIGHLY RECOMMEND NOT USING THIS BRANCH FOR ANY REASON."
}