{
    "DONT CHANGE ANYTHING IN THIS FILE": "DONT CHANGE ANYTHING IN THIS FILE UNLESS YOU KNOW WHAT YOU'RE DOING",

    "version": "1.6.1",
    "branch": "dev",

    "versionText": "",
    "todo": {
        "History show revealed card": ["done", "Sometimes, a card gets hidden in the history. This is because the user shouldn't have access to that information. However when that card has been revealed (e.g. Playing it), it should be shown again everywhere where it was hidden."],
        "Card Placeholder": ["not done", "When a card gets referenced by name in another card's description, have it show more details about it when you entire detail mode."],
        "Add a lot more events": ["not done", "The more events, the better."],
        "Add back getter / setters for all modules": ["not done", "I removed all getters and setters a while ago. But that has caused some issues now in the future. This can also allow unifying players and cards so they can be used interchangeably as targets."],
        "Rewrite the tools / scripts in Rust": ["not done", "Pretty self-explanatory."]
    },

    "exampleTodo": {
        "one": ["first pass", "Description."],
        "two": ["second pass", "Another description."],
        "three": ["not done", "A third description."],
        "four": ["doing", "A fourth description."],
        "five": ["done", "A fifth description."],
        "this gives us": {
            "one":   "[first pass] one",
            "two":   "[second pass] two",
            "three": "[ ] three",
            "four":  "[o] four",
            "five":  "[x] five"
        }
    },

    "stableIntroText": "This is the main (stable) branch. This branch is older, but is more stable. I recommend you use this branch.",
    "developIntroText": "This is the develop (beta) branch. This has more features, but is less stable. I would advise against using this branch if you can help it. The todo list is not final and can change.",
    "topicIntroText": "This is a topic (feature) branch. This branch exists to add one single feature, can be highly unstable, and will be deleted in the future once the feature is done. I HIGHLY RECOMMEND NOT USING THIS BRANCH FOR ANY REASON."
}